package com.sist.temp;
/*  
 *  구상 => 요구사항분석
 *  	벤치마킹 => 모방
 *  	| 기능 추출
 *  	| 메소드 => 리턴형 / 매개변수
 *  	  => 반복하는 소스 : 공통 모듈
 *  	  => ------------------- 다른 프로그램에서 사용
 *  	  						 .jav로 묶어서 사용
 *  => 사용자 정의 + 라이브러리 = 조립
 *     ------------------
 *  => 1. 필요한 변수 : VO
 *  => 2. 기능 설정 : Manager / DAO
 *  						 ----
 *  						  | 오라클 연동
 *  						  | 언어 => SQL
 *  							---------- SELECT * FROM emp
 *  => 3. 화면 UI
 *  => 4. 화면에 값을 채운다
 *  => 5. 한개의 기능을 처리 => 메소드 => 응집성
 *  	  => 유지보수 / 수정, 삭제
 *  	  기능을 모아서 관리 => 클래스
 *  => 시간 (2월, 6월) => 정보처리
 *     -----------------------
 *  
 *  ----------------------------------------------
 *  class ClassName{
 *  	구성요소
 *  }
 */
public class 응용프로그램 {

}
